// ここでは数値に対する演算について学習します。
// 他の言語とほとんど同じです。
// ただし、C#では、整数の割り算は整数同士の割り算になります。
// 例えば、3/2の結果は1になります。
// これは、C#の整数型は整数同士の割り算の結果も整数になるためです。
// これを回避するには、少なくとも一方を少数型にキャストする必要があります。
// 例えば、3.0/2の結果は1.5になります。
// また、C#では、整数型の変数に少数を代入することはできません。
// 例えば、int a = 1.5;とすると、コンパイルエラーになります。
// これは、C#の整数型は整数しか扱えないためです。
// これを回避するには、少なくとも一方を少数型にキャストする必要があります。
// 例えば、int a = (int)1.5;とすると、aには1が代入されます。

// では、基本的な演算を行いましょう♪

Console.WriteLine(1 + 2); // 3
Console.WriteLine(1 - 2); // -1
Console.WriteLine(1 * 2); // 2
Console.WriteLine(5 / 2); // 2
